{
  "version": "1.0.6",
  "notes": "— Добавлен переключатель «Перекодировать видео в фиксированный битрейт (NVENC)» на экране поиска Kino.pub. Галочка напрямую управляет режимом работы модуля HLS: при включении идёт перекодирование в фиксированный битрейт, при снятии — только MUX без перекодирования (быстрее и меньше нагрузка на систему).\n— Состояние галочки NVENC теперь запоминается между запусками приложения: значение хранится в settings.json, подхватывается при старте и сразу передаётся в движок kino_hls.\n— Доработан экран «Kino.pub Search»: нижняя панель с кнопками «Проверить в медиатеке» и «Добавить выбранные в очередь» переразмечена так, чтобы кнопки не «съезжали» и не прилипали к таблице результатов при изменении размеров окна и масштабирования.\n— Улучшена связка модулей «Kino.pub Search» и «Работа с запросами»: кнопки «Найти выбранные» и «Найти не найденные» на экране запросов открывают экран поиска с уже подготовленным списком карточек. Если запросы пришли из новинок/поиска, используются сохранённые URL карточек; если список введён вручную или загружен из TXT — автоматически выполняется онлайн-поиск по названиям.\n— Логика поиска из модуля запросов сделана более наглядной: теперь перед добавлением в очередь пользователь видит все найденные релизы на отдельном экране и может вручную выбрать нужный вариант, а уже затем отправить его в Kino.pub Downloader.\n— Расширено контекстное меню очереди загрузки Kino.pub: помимо «Повторить / перезапустить загрузку» добавлены пункты «Открыть папку загрузки» и «Удалить (если ожидает)». Меню теперь доступно для любого элемента очереди, а не только при ошибке.\n— Ускорен поиск и выгрузка новинок Kino.pub: доработан отдельный скрытый Chromium-драйвер для поиска/новинок, добавлено кэширование года по карточке, уменьшено число повторных запросов и снижена вероятность подвисаний при парсинге страниц.\n— Из сборки удалён неиспользуемый модуль OCR и связанные с ним зависимости (easyocr и вспомогательные файлы), за счёт чего установщик стал компактнее, а сборка PyInstaller — проще и стабильнее.\n— Исправлены мелкие визуальные огрехи: выровнаны отступы и рамки в тёмной теме Movie Tools, подправлены подписи кнопок и поведение элементов управления на экранах запросов и поиска Kino.pub.",
  "installer": "MediaSearch_Setup_1.0.6.exe",
  "sha256": "9ef094e224965bc0cf338b6f191b51cf9b96956497bade8f53accd2dc4e2c1c2"
}
