{
  "version": "1.0.5",
  "notes": "— Новый модуль «Работа с запросами»: вставка списка фильмов, загрузка из TXT, проверка наличия в медиатеке NAS по индексу EFU, статусы («Найдено», «Нет в медиатеке», предупреждение по году), выбор одного из нескольких путей, опция «Копировать метафайлы» и копирование отмеченных фильмов в отдельную папку с прогресс-окном.\n— Интеграция поиска Kino.pub с модулем запросов: с экрана «Kino.pub Search» можно отправить выбранные результаты в «Работу с запросами», при этом для каждой строки запоминается исходный URL карточки.\n— Кнопки «Скачать выбранные» и «Скачать не найденные» на экране запросов: для соответствующих строк выполняется поиск карточек на Kino.pub (с использованием сохранённых URL или онлайн-поиска), и лучшие совпадения сразу добавляются в очередь загрузки Kino.pub Downloader. В конце показывается, сколько элементов добавлено и сколько не удалось найти.\n— На экране «Работа с запросами» добавлена кнопка «Войти в Kino.pub», на экране «Kino.pub Search» — кнопка «Проверить NAS» для быстрой загрузки или обновления индекса медиатеки.\n— Добавлен отдельный экран «Kino.pub Search»: поиск фильмов по одному названию, по списку и из TXT-файла, а также выгрузка новинок по диапазону страниц. Результаты показываются в таблице с годом, URL и чекбоксами; двойной клик открывает карточку в браузере.\n— Реализован реальный поиск по сайту Kino.pub через встроенный Chromium (undetected_chromedriver) с учётом актуальной вёрстки страниц поиска и новинок.\n— Появилась возможность добавлять выбранные результаты поиска (по галочкам или по выделению строк) напрямую в очередь загрузки Kino.pub Downloader.\n— В очереди загрузки Kino.pub добавлено контекстное меню по правому клику: пункт «Повторить / перезапустить загрузку» позволяет заново запустить любой элемент, независимо от текущего статуса.\n— Введена единая авторизация Kino.pub: пока пользователь не выполнил вход, поле URL, выбор папки и кнопки поиска/скачивания недоступны и показывают окно с подсказкой «Сначала выполните вход в Kino.pub».\n— Обновлён парсер карточек Kino.pub: корректно извлекает название и год как для результатов поиска, так и для раздела новинок, убирает дубли и лишние годы в скобках.\n— При закрытии приложения по крестику дополнительно завершается отдельный драйвер поиска Kino.pub, а также все фоновые процессы ffmpeg и Chromium, чтобы не оставались «висячие» процессы.\n— Исправлены мелкие ошибки интерфейса и приведения стилей: все новые диалоги и служебные окна оформлены в едином тёмном стиле Movie Tools.",
  "installer": "MediaSearch_Setup_1.0.5.exe",
  "sha256": "EF59931845024370B0776087F41AB44204D7A3EB6340F727B111975F021AA6F6"
}
